[
  {
    "input": "What is Python?",
    "response": "Python is a high-level, interpreted programming language known for its simplicity and readability."
  },
  {
    "input": "How do I install Python?",
    "response": "You can download Python from the official website (python.org) and follow the installation instructions for your operating system."
  },
  {
    "input": "What are the benefits of using Python?",
    "response": "Python offers many benefits, including ease of learning, extensive libraries, cross-platform compatibility, and versatility in various domains such as web development, data science, and artificial intelligence."
  },
  {
    "input": "Discipline",
    "response": "control gained by enforcing obedience or order"
  },
  {
    "input": "disc",
    "response": "a round flat plate coated with a magnetic substance on which data for a computer is stored."
  },
  {
    "input": "What is a computer?",
    "response": "A computer is an electronic device that can perform various tasks by executing instructions given to it in a program."
  },
  {
    "input": "Define knowledge",
    "response": "Knowledge is the information, understanding, and skills acquired through experience or education."
  },
  {
    "input": "What is education?",
    "response": "Education is the process of receiving or giving systematic instruction, especially in a school or university."
  },
  {
    "input": "What is science?",
    "response": "Science is the systematic study of the structure and behavior of the physical and natural world through observation and experiment."
  },
  {
    "input": "What is data science?",
    "response": "Data science is the field of using statistical, mathematical, and computational methods to extract insights from data."
  },
  {
    "input": "What is machine learning?",
    "response": "Machine learning is a subset of AI that enables systems to learn and improve from experience without being explicitly programmed."
  },
  {
    "input": "What is artificial intelligence?",
    "response": "Artificial intelligence (AI) is the simulation of human intelligence processes by machines, especially computer systems."
  },
  {
    "input": "What is HTML?",
    "response": "HTML (HyperText Markup Language) is the standard language used to create and design web pages."
  },
  {
    "input": "What is CSS?",
    "response": "CSS (Cascading Style Sheets) is used to style and layout HTML elements on a web page."
  },
  {
    "input": "What is JavaScript?",
    "response": "JavaScript is a programming language used to make web pages interactive and dynamic."
  },
  {
    "input": "What is software?",
    "response": "Software is a set of instructions that tell a computer what to do. It includes applications and operating systems."
  },
  {
    "input": "What is hardware?",
    "response": "Hardware refers to the physical components of a computer system, such as the CPU, memory, and hard drive."
  },
  {
    "input": "What is an operating system?",
    "response": "An operating system is system software that manages computer hardware, software resources, and provides services for programs."
  },
  {
    "input": "What is cloud computing?",
    "response": "Cloud computing is the delivery of computing services like storage and processing power over the internet on demand."
<<<<<<< HEAD
=======
  },
  {
    "input": "tell me what is a problem",
    "response": "a matter or situation regarded as unwelcome or harmful and needing to be dealt with and overcome."
>>>>>>> ed85eb6 (Fixed logic of yes/no response from the chatbot to be more realistic)
  }
]
